dvucinozd/nektarina/sdkconfig.defaults
# Ciljna platforma
CONFIG_IDF_TARGET="esp32s3"

# 16MB Octal Flash i 8MB Octal PSRAM
CONFIG_ESPTOOLPY_FLASHMODE_OPI=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_BOOT_INIT=y
CONFIG_SPIRAM_USE_MALLOC=y

# USB Host Controller
CONFIG_USB_HOST_CONTROL_TRANSFER_MAX_SIZE=256
CONFIG_USB_HOST_HW_BUFFER_BIAS_BALANCED=y

# FreeRTOS takt
CONFIG_FREERTOS_HZ=1000
